In [98]:
import pandas as pd

In [104]:
al=pd.DataFrame({
    'Names':['Bob','jessica','Mary','John','Mel'],
    'Births':[968,155,77,578,973]})
al

     Names  Births
0      Bob     968
1  jessica     155
2     Mary      77
3     John     578
4      Mel     973

In [100]:
al.loc[:,['Names']]

     Names
0      Bob
1  jessica
2     Mary
3     John
4      Mel

In [101]:
alll=list(range(0,4))
print(alll)
a=al.iloc[alll,:]
print(a)

[0, 1, 2, 3]
     Names Births
0      Bob    968
1  jessica    155
2     Mary     77
3     John    578

In [112]:
b=al['Births']
print(b[b>100])

0    968
1    155
3    578
4    973
Name: Births, dtype: int64

In [111]:
print(b.mean())

550.2

In [95]:
al.mean()
means=al.mean(axis=1)
mean=al.iloc[[1]].mean(axis=1)
print(mean)

1   NaN
dtype: float64

In [155]:
jb=pd.DataFrame({
    'name':['John','Jenny','Nate'],
    'age':[20,20,30],
    'job':['student','developer','teacher']})
jb

    name  age        job
0   John   20    student
1  Jenny   20  developer
2   Nate   30    teacher

In [134]:
jb.iloc[1:3,:]

    name  age        job
1  Jenny   20  developer
2   Nate   30    teacher

In [135]:
jb.loc[[0,2]]

   name  age      job
0  John   20  student
2  Nate   30  teacher

In [136]:
jb.iloc[:,0:2]

    name  age
0   John   20
1  Jenny   20
2   Nate   30

In [137]:
jb.iloc[:,[0,2]]

    name        job
0   John    student
1  Jenny  developer
2   Nate    teacher

In [150]:

a_row=jb['age'][jb['age']>=27]

a_row.values

array([30], dtype=int64)

In [161]:
#first_row =jb.loc['']
print(first_row.keys()[0])



#print(a[a >= 27 and n='Jenny'])

NameError: name 'first_row' is not defined